tutorials/precursorABL/unstable/system/setFieldsABLDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          setFieldsABLDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../0/include/initialConditions"

// Extents of the domain (assumes x, y, and z start from 0.0).
xMax                      5000.0;
yMax                      5000.0;
zMax                      2000.0;

// Specify how to initialze the base velocity and temperature profile.
//velocityInitType          "table";
//velocityInitType          "log";
velocityInitType          "geostrophic";
//temperatureInitType       "table";
temperatureInitType       "simple";

// Maximum perturbation of streamwise/spanwise flow near surface.
deltaU                    0.5;
deltaV                    0.5;

// Total periods of perturbations in streamwise/spanwise in the domain.
Uperiods                  10.0;
Vperiods                  10.0;

// Percentage of domain height (zMax) where peak in perturbation 
// magnitude occurs.
zPeak                     0.03;

// Initial height of the center of the capping inversion.
zInversion                750.0;

// Width of the capping inversion.
widthInversion            100.0;

// Potential temperature at the bottom and top of the capping inversion.
Tbottom                   300.0;
Ttop                      308.0;

// Maximum temperature fluctuation size below capping inversion.
TPrimeScale               0.0;

// Height rate of change of potential temperature above the inversion.
dTdz                      0.003;

// Geostrophic wind speed magnitude.
Ug                        8.0;

// Geostrophic wind speed direction.
UgDir                     240.0;

// Aerodynamic roughness height of surface.
z0                        0.1;

// von Karman constant.
kappa                     0.4;

// Vertical profile table.
profileTable
(
//   z          U       V        T
    (   0.00    6.50    0.00   300.0)
    ( 150.00    6.50    0.00   300.0)
    ( 700.00    6.50    0.00   305.5)
);

// Update internal field.
updateInternalFields      true;

// Update boundary field.
updateBoundaryFields      true;

// ************************************************************************* //
